#include <iostream>

using namespace std;

// 当a1,a2不变的时候，a3换成a3+15 结果不变
// 当a1,a3不变的时候，a2换成a2+30 结果不变
// 当a2,a3不变的时候，a1换成a1+10 结果不变

// 因此只需要遍历a1从n-9到n
// 因此只需要遍历a2从n-29到n
// 因此只需要遍历a3从n-14到n
// 然后找出满足条件的解即可 时间复杂度是O(1)
// 解在这个范围内一定存在，原因是 n-n%10,n-n%30,n-n%15 一定是一个解
// 题目给出的描述是n取值[0,100],但用这个方法，即使n很大，也可以快速算出来

int main()
{
    int n;
    cin >> n;
    for (int a1 = n; a1 >= n - 9; --a1)
    {
        for (int a2 = n; a2 >= n - 29; --a2)
        {
            for (int a3 = n; a3 >= n - 14; --a3)
            {
                if ((a1 + a2) % 2 == 0 && (a2 + a3) % 3 == 0 && (a1 + a2 + a3) % 5 == 0)
                {
                    cout << a1 << " " << a2 << " " << a3 << endl;
                    return 0;
                }
            }
        }
    }
}